name: Baseline Playbook - Sigma
id: 1600007
description: |
    This is the baseline playbook for Sigma detections.
type: detection
detection_id: ''
detection_category: ''
detection_type: sigma
contributors:
  - 'SecurityOnionSolutions'
created: 2025-03-28
modified: 2025-04-23
questions:
  - question: 'Are there any other alerts associated with the internal system?'
    context: 'Identifying related alerts can help determine if the internal system is experiencing a broader issue.'
    answer_sources:
        - alert
    range: -1d
    query: |
        aggregation: true
        logsource:
          category: alert
        detection:
            selection:
                - related.ip: '{related.ip}'
            condition: selection
        fields:
            - rule.type
            - rule.name