name: Security Onion IDH - SSH Connection
id: 1600021
description: |
    Detects when attempts are made to access the IDH SSH service. This indicates potential malicious activity targeting SSH services. Review the source IP for context.
type: detection
detection_id: 'fcf94210-f188-4363-a707-a1a410ebec03'
detection_category: ''
detection_type: 'sigma'
contributors:
  - 'SecurityOnionSolutions'
created: 2025-06-26
modified: 2025-06-30
questions:
  - question: "What system is the SSH connection attempt associated with?"
    context: "Is it an approved vulnerability scanner?"
    query: |
        aggregation: false
        logsource:
            product: alert
        detection:
            selection:
                document_id: '{soc_id}'
            condition: selection
        fields:
            - event_data.source.ip
  - question: "Are there other IDH alerts from this source IP?"
    context: "Check if this IP has triggered other IDH services, which can indicate broader reconnaissance or attack activity."
    range: -7d
    query: |
        aggregation: true
        logsource:
            product: alert
        detection:
            selection:
                event_data.source.ip: '{event_data.source.ip}'
                event_data.tags: 'idh'
            condition: selection
        fields:
            - rule.name
            - event_data.host.name
