name: Security Onion IDH - SSH Login Attempt
id: 1500005
description: |
    Detects when attempts are made to login to the IDH SSH service. This indicates potential malicious activity targeting SSH services. Review the source IP and username for context.
type: detection
detection_id: '6b033764-7a14-4c7c-9109-300392a051ce'
detection_category: ''
detection_type: 'sigma'
contributors:
  - 'SecurityOnionSolutions'
created: 2025-06-26
modified: 2025-06-30
questions:
  - question: "What system is the SSH login attempt associated with?"
    context: "Is it an approved vulnerability scanner or some other legitimate system (ie asset inventory scanner)?"
    query: |
        aggregation: false
        logsource:
            product: alert
        detection:
            selection:
                document_id|expand: '%document_id%'
            condition: selection
        fields:
            - event_data.source.ip
  - question: "Is the username used in the login attempt a generic name or is it specific to your organization?"
    context: "This distinction can provide insight into common attack patterns or if known credentials are being tested."
    query: |
        aggregation: false
        logsource:
            product: alert
        detection:
            selection:
                document_id|expand: '%document_id%'
            condition: selection
        fields:
            - event_data.user.name
  - question: "Is the password used in the login attempt common or organization-specific?"
    context: "This helps identify common passwords being used in brute force attacks or if organization-specific credentials are being tested."
    query: |
        aggregation: false
        logsource:
            product: alert
        detection:
            selection:
                document_id|expand: '%document_id%'
            condition: selection
        fields:
            - event_data.idh.password_submitted
  - question: "What SSH client version was used by the attacker?"
    context: "The SSH client version can provide insight into the tools being used by the attacker."
    query: |
        aggregation: false
        logsource:
            product: alert
        detection:
            selection:
                document_id|expand: '%document_id%'
            condition: selection
        fields:
            - event_data.logdata.REMOTEVERSION
  - question: "Are there other IDH SSH login attempts from this source IP?"
    context: "Check if this IP has triggered other IDH services, which can indicate broader reconnaissance or attack activity."
    range: -7d
    query: |
        aggregation: true
        logsource:
            product: alert
        detection:
            selection:
                event_data.source.ip|expand: '%event_data.source.ip%'
                event_data.tags: 'idh'
            condition: selection
        fields:
            - rule.name
            - event_data.host.name
